{
  "backend/main.mo": "Main Motoko actor defining all data types (FoodEntry, Product, Order, Workout, Video, NewsArticle, RunningSession, etc.) and including authorization and storage mixins for the fitness platform backend.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including external sports products hook, Store page updates with external API integration, external fitness videos hook, and their associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including App routing, Layout, Navigation with global search, Store with hybrid product catalog, WorkoutTracker, FiTube, and SearchResults functionality.",
  "frontend/.env.example": "Environment variable template defining configuration for Go Store API, external fitness search API, sports products API, and fitness videos API with placeholder URLs and API keys.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes, spacing, and theme tokens for both light and dark modes using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Frontend documentation describing FIT AMIGO features (e-commerce, workout tracking, FiTube, admin dashboard) and detailed setup instructions for configuring external API integrations including Go Store, fitness search, sports products, and fitness videos APIs.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including Store, ProductDetail, Cart, Checkout, Orders, WorkoutTracker, AdminDashboard, FiTube, RunningMonitor, FoodTracker, SearchResults, and ComingSoon pages with Layout wrapper.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied error screen with a shield icon, customizable message, and a button to return to the store.",
  "frontend/src/components/AddNewsArticleDialog.tsx": "Dialog form for adding news articles with support for internal/external article types, image uploads with progress tracking, and various metadata fields (title, author, category, publication date).",
  "frontend/src/components/AdminProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, quantity, and image upload with progress tracking.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product image, quantity controls (increment/decrement), remove button, and calculated item total.",
  "frontend/src/components/CartSummary.tsx": "Shows order summary card with subtotal, 10% tax calculation, and total price for the shopping cart.",
  "frontend/src/components/CheckoutForm.tsx": "Form component for checkout with shipping address fields (street, city, state, zip) and contact information (phone, email) with validation.",
  "frontend/src/components/ComingSoon.tsx": "Displays a coming soon placeholder page with a rocket icon, feature name, description, and Phase 2 & 3 notice.",
  "frontend/src/components/DeleteNewsArticleDialog.tsx": "Confirmation dialog for deleting a news article with article title display and delete action using the useDeleteNewsArticle hook.",
  "frontend/src/components/EditNewsArticleDialog.tsx": "Dialog form for editing existing news articles that loads article data, supports internal/external types, and handles image uploads with progress tracking.",
  "frontend/src/components/FoodEntryCard.tsx": "Displays a single food entry with nutritional information (calories, protein, carbs, fat) and a delete button with confirmation dialog. Formats timestamps and uses toast notifications for delete operations.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that includes navigation, profile setup modal, footer with caffeine.ai attribution, and toast notifications. Renders children or Outlet for nested routes.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity. Handles authentication flow with loading states and error recovery.",
  "frontend/src/components/MacroSummaryCard.tsx": "Displays aggregated daily nutrition totals (calories, protein, carbs, fat) from food entries with color-coded icons. Calculates sums from an array of food entries.",
  "frontend/src/components/Navigation.tsx": "Main navigation header with logo, desktop/mobile menus, search bar with debouncing, and conditional admin link. Includes links to Store, FiTube, Workout, Running, Food, and News sections.",
  "frontend/src/components/OrderCard.tsx": "Displays order summary card with order ID, status badge, date, item count, and total price. Links to detailed order view page.",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a colored badge for order status (delivered, shipped, processing, pending) with appropriate styling for each state.",
  "frontend/src/components/ProductCard.tsx": "Displays product information with image, name, description, price, and stock. Supports both internal and external products with different styling and behaviors (add to cart vs external link).",
  "frontend/src/components/ProductFilters.tsx": "Filter controls for products including category dropdown (gym equipment, running gear, apparel, supplements, equipment) and max price input field.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to create one by entering their name and email. Uses Internet Identity authentication and displays validation errors via toast notifications.",
  "frontend/src/components/RunningSessionCard.tsx": "Card component displaying a running session with distance, duration, date, and optional notes. Includes a delete button with confirmation dialog and formats timestamps and durations for display.",
  "frontend/src/components/VideoCard.tsx": "Card component that displays either internal or external fitness videos with thumbnails, titles, uploader info, and engagement metrics. Clicking navigates to video details or opens external links in new tabs.",
  "frontend/src/components/VideoCommentsSection.tsx": "Comment section component for videos that allows authenticated users to add comments and delete their own comments. Displays comment list with user profiles and relative timestamps.",
  "frontend/src/components/WorkoutCard.tsx": "Card component displaying workout details including exercise name, sets, reps, and weight in a grid layout with color-coded metrics.",
  "frontend/src/components/WorkoutForm.tsx": "Form component for logging workouts with fields for exercise name, sets, reps, and weight. Uses react-hook-form for validation and displays loading state during submission.",
  "frontend/src/config/api.ts": "Configuration file that exports environment variables for external API integrations (Go Store, Sports Products, Fitness Videos) and provides helper functions to check if each API is configured.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes and handles admin token initialization.",
  "frontend/src/hooks/useAddComment.ts": "React Query mutation hook for adding comments to videos. Currently throws an error as the backend method is not yet implemented, but includes query invalidation logic for when it's ready.",
  "frontend/src/hooks/useAddNewsArticle.ts": "React Query mutation hook for adding a news article; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useAddProduct.ts": "React Query mutation hook for adding a product; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useAddToCart.ts": "React Query mutation hook for adding items to cart; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useDeleteComment.ts": "React Query mutation hook for deleting video comments; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useDeleteFoodEntry.ts": "React Query mutation hook that calls the backend actor to delete a food entry and invalidates related queries on success.",
  "frontend/src/hooks/useDeleteNewsArticle.ts": "React Query mutation hook for deleting a news article; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useDeleteProduct.ts": "React Query mutation hook for deleting a product; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useDeleteRunningSession.ts": "React Query mutation hook that calls the backend actor to delete a running session and invalidates related queries on success.",
  "frontend/src/hooks/useEditFoodEntry.ts": "React Query mutation hook that calls the backend actor to edit a food entry and invalidates related queries on success.",
  "frontend/src/hooks/useEditNewsArticle.ts": "React Query mutation hook for updating a news article; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useEditProduct.ts": "React Query mutation hook for editing a product; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useExternalSearch.ts": "React Query hook that fetches external fitness search results from the backend, parses JSON response, and transforms it to ExternalSearchResult format.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useGetCart.ts": "React Query hook for fetching cart items; currently returns an empty array as the backend method is not yet implemented.",
  "frontend/src/hooks/useGetExternalFitnessVideos.ts": "React Query hook that fetches external fitness videos from the backend, parses JSON response, and transforms it to ExternalFitnessVideo format.",
  "frontend/src/hooks/useGetExternalProducts.ts": "React Query hook that fetches external products from Go Store API if configured, parses JSON response, and transforms it to ExternalProduct format.",
  "frontend/src/hooks/useGetExternalSportsProducts.ts": "React Query hook that fetches external sports products with optional category and search filters, parses JSON response, and transforms it to ExternalSportsProduct format.",
  "frontend/src/hooks/useGetFoodEntry.ts": "React Query hook that fetches a single food entry by ID from the backend actor.",
  "frontend/src/hooks/useGetNewsArticle.ts": "React Query hook that fetches a single news article by ID from the backend actor.",
  "frontend/src/hooks/useGetNewsArticles.ts": "React Query hook that fetches all news articles with optional category filtering from the backend actor.",
  "frontend/src/hooks/useGetOrder.ts": "React Query hook that fetches a single order by ID from the backend actor.",
  "frontend/src/hooks/useGetProduct.ts": "React Query hook that fetches a single product by ID from the backend actor.",
  "frontend/src/hooks/useGetUserFoodEntries.ts": "React Query hook that fetches all food entries for the authenticated user from the backend actor.",
  "frontend/src/hooks/useGetUserOrders.ts": "React Query hook that fetches all orders for the authenticated user from the backend actor.",
  "frontend/src/hooks/useGetUserProfile.ts": "React Query hook that fetches a user profile by Principal ID from the backend actor.",
  "frontend/src/hooks/useGetUserRunningSessions.ts": "React Query hook that fetches all running sessions for the authenticated user from the backend actor.",
  "frontend/src/hooks/useGetVideo.ts": "React Query hook that fetches a single video by ID using getAllVideos as a workaround and filtering by ID.",
  "frontend/src/hooks/useGetVideoComments.ts": "React Query hook that fetches all comments for a specific video from the backend actor.",
  "frontend/src/hooks/useGetVideos.ts": "React Query hook that fetches all videos from the backend actor.",
  "frontend/src/hooks/useGetWorkouts.ts": "React Query hook that fetches all workouts for the authenticated user from the backend actor.",
  "frontend/src/hooks/useHasLikedVideo.ts": "React Query hook that checks if the authenticated user has liked a specific video from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current authenticated user has admin privileges by calling the backend actor's isCallerAdmin method.",
  "frontend/src/hooks/useLikeVideo.ts": "React Query mutation hook for liking videos; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useLogFood.ts": "React Query mutation hook for logging food entries; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useLogRunningSession.ts": "React Query mutation hook that logs running sessions with distance, duration, and optional notes, then invalidates the running sessions cache.",
  "frontend/src/hooks/useLogWorkout.ts": "React Query mutation hook that logs workout data to the backend and invalidates the workouts query cache on success.",
  "frontend/src/hooks/usePlaceOrder.ts": "React Query mutation hook that places an order with a shipping address and invalidates cart and orders caches on success.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that query hooks are defined in separate individual files.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile and invalidates the currentUserProfile query cache on success.",
  "frontend/src/hooks/useSearchContent.ts": "React Query hook that searches content by term, enabled only when actor is ready and search term is at least 2 characters.",
  "frontend/src/hooks/useSearchProducts.ts": "React Query hook that searches products by term using the backend actor when available.",
  "frontend/src/hooks/useUnlikeVideo.ts": "React Query mutation hook for unliking videos; currently throws an error as the backend method is not yet implemented.",
  "frontend/src/hooks/useUploadVideo.ts": "React Query mutation hook that uploads videos with title, description, and file blob, then invalidates the videos query cache.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining fitness-themed color palette (energetic orange, vibrant green, bold red, sunny yellow) and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AddFood.tsx": "Page component for searching and logging food entries with nutritional information; includes mock search functionality and requires user authentication.",
  "frontend/src/pages/AddRunningSession.tsx": "Form page for logging running sessions with distance, duration, and optional notes using react-hook-form validation.",
  "frontend/src/pages/AddWorkout.tsx": "Page for logging a new workout with a form that submits exercise name, sets, reps, and weight, then navigates back to the workout tracker on success.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page that checks admin permissions and displays cards linking to product management and news management sections.",
  "frontend/src/pages/AdminNewsManagement.tsx": "Admin page for managing news articles with a table view, add/edit/delete dialogs, category badges, and article type filtering (internal/external).",
  "frontend/src/pages/AdminProductManagement.tsx": "Admin page for managing internal products with a table displaying product details and actions for adding, editing, and deleting products.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with quantity controls, calculates subtotal, and provides checkout navigation with authentication checks.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a shipping address form and order summary that places orders and redirects to order confirmation on success.",
  "frontend/src/pages/FiTube.tsx": "Video sharing platform page that displays both internal and external fitness videos in a grid with upload functionality for authenticated users.",
  "frontend/src/pages/FoodTracker.tsx": "Food tracking page that displays a hero banner, daily macro summary, and list of food entries with options to log new meals. Requires user authentication and shows loading/empty states.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page displaying order details including ID, status, shipping address, items count, and total price with navigation to order history or store. Shows loading state while fetching order data.",
  "frontend/src/pages/OrderDetail.tsx": "Detailed order view page showing order items with product images, quantities, prices, shipping address, and status badge. Includes back navigation to orders list.",
  "frontend/src/pages/OrderHistory.tsx": "Order history page listing all user orders using OrderCard components. Requires authentication and displays empty state when no orders exist.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing product image, name, price, description, availability, and add-to-cart functionality. Requires authentication to add items to cart.",
  "frontend/src/pages/RunningMonitor.tsx": "Running tracking page with hero banner, statistics summary cards (total runs, distance, duration), and list of running sessions. Requires authentication and displays empty state for new users.",
  "frontend/src/pages/SearchResults.tsx": "Search results page displaying both internal content (products, videos, articles, workouts, etc.) grouped by type and external search results with appropriate icons and links. Requires minimum 2 characters to search.",
  "frontend/src/pages/Store.tsx": "Store page component that displays and filters products from multiple sources (internal, external, and sports products), with search, category filtering, price filtering, and add-to-cart functionality requiring authentication.",
  "frontend/src/pages/UploadVideo.tsx": "Video upload page with form handling for title, description, and video file (max 100MB), using ExternalBlob for upload with progress tracking and requiring user authentication.",
  "frontend/src/pages/VideoDetail.tsx": "Video detail page displaying video player, metadata, uploader info, like/unlike functionality, share button, and comments section, requiring user authentication.",
  "frontend/src/pages/WorkoutTracker.tsx": "Workout tracker page that displays user's logged workouts in a grid layout with option to add new workouts, requiring authentication and showing empty state when no workouts exist.",
  "frontend/src/types/ExternalProduct.ts": "TypeScript interface defining the shape of external products with id, name, price, imageUrl, externalUrl, and isExternal flag.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular query strings and hash-based routing with persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (energetic-orange, vibrant-green, bold-red, sunny-yellow), extended theme settings, container queries, typography plugin, and custom animations.",
  "project_state.json": "Project state file tracking FIT AMIGO fitness platform development across 3 phases: authentication/e-commerce/workout tracker (Phase 1), hybrid product catalog with admin interface (Phase 2), and FiTube/Running Monitor/Food Tracker/News/Search features (Phase 3). Currently updating Store to show external sports products and FiTube to fetch external fitness videos via APIs."
}