{
  "backend/main.mo": "Main Motoko actor implementing a fitness platform with e-commerce (products, orders, carts), workout tracking, video sharing (FiTube), running sessions, food diary with Nutritionix API integration, and role-based access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for food tracking: food diary page with macro summary, add food page with search, React Query hooks for food operations, and navigation link integration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including Store, Workout Tracker, FiTube, Running Monitor, Food Tracker, and Admin features with routing and state management details.",
  "frontend/.env.example": "Environment variable template for configuring Go Store API integration with placeholders for API URL and key.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes for the application including sidebar, chart, and component colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Project documentation describing FIT AMIGO fitness platform features (e-commerce, workout tracking, social features) and setup instructions for Go Store API integration via environment variables.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including Store, Workout Tracker, Admin, FiTube, Running Monitor, Food Tracker, and placeholder routes for News and Search features.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable access denied component displaying a shield alert icon, customizable message, and return-to-store button for unauthorized access scenarios.",
  "frontend/src/components/AdminProductForm.tsx": "Form component for adding or editing products with fields for name, description, price, quantity, and image upload. Handles image upload progress and uses react-hook-form for validation and submission.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product image, name, price, quantity controls (increment/decrement), and remove button. Shows calculated item total and enforces stock quantity limits.",
  "frontend/src/components/CartSummary.tsx": "Card component that displays order summary with subtotal, 10% tax calculation, and total amount. Styled with energetic-orange border for emphasis.",
  "frontend/src/components/CheckoutForm.tsx": "Form component for collecting shipping address (street, city, state, zip) and contact information (phone, email) during checkout. Uses react-hook-form with validation and displays loading state during submission.",
  "frontend/src/components/ComingSoon.tsx": "Placeholder component that displays a rocket icon, feature name, and description for features planned for Phase 2 & 3. Uses gradient styling with brand colors.",
  "frontend/src/components/FoodEntryCard.tsx": "Card component displaying a food entry with timestamp, serving size, and macronutrient breakdown (calories, protein, carbs, fat). Includes delete functionality with confirmation dialog.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with navigation, profile setup modal, footer with Caffeine.ai attribution, and toast notifications. Renders children or Outlet for nested routes.",
  "frontend/src/components/LoginButton.tsx": "Button component for Internet Identity authentication that toggles between login and logout states. Handles authentication errors and clears query cache on logout.",
  "frontend/src/components/MacroSummaryCard.tsx": "Card component that aggregates and displays total daily nutrition from food entries with icon-decorated metrics for calories, protein, carbs, and fat. Uses gradient backgrounds for visual appeal.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with responsive mobile/desktop menus, displaying links to Store, FiTube, Workout, Running, Food, News, Search, and conditionally Admin for authenticated admin users. Includes logo, login button, and active route highlighting.",
  "frontend/src/components/OrderCard.tsx": "Displays a clickable order summary card showing order ID, status badge, date, item count, and total price with a chevron icon. Links to the detailed order page.",
  "frontend/src/components/OrderStatusBadge.tsx": "Renders a colored badge for order status (pending, processing, shipped, delivered) with appropriate color coding and capitalized label.",
  "frontend/src/components/ProductCard.tsx": "Displays product information in a card format supporting both internal and external products, with image, name, price, stock info, and either an 'Add to Cart' button or external link to Go Store.",
  "frontend/src/components/ProductFilters.tsx": "Filter component for products with category dropdown (All/Equipment/Supplements) and max price input field.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter name and email to create their profile.",
  "frontend/src/components/RunningSessionCard.tsx": "Displays a running session with distance, duration, date, optional notes, and a delete button with confirmation dialog.",
  "frontend/src/components/VideoCard.tsx": "Clickable video card showing video thumbnail, title, uploader name, like count, and comment count that navigates to the video detail page.",
  "frontend/src/components/VideoCommentsSection.tsx": "Displays a video comments section with comment list, add comment form, and delete functionality. Uses hooks for fetching comments, adding/deleting comments, and user profiles with authentication checks.",
  "frontend/src/components/WorkoutCard.tsx": "Renders a card displaying workout details including exercise name, sets, reps, and weight with color-coded metrics and hover effects.",
  "frontend/src/components/WorkoutForm.tsx": "Form component for logging workouts with fields for exercise name, sets, reps, and weight, using react-hook-form for validation.",
  "frontend/src/config/api.ts": "Configuration file for external API integration, exposing Go Store API URL and key from environment variables with a helper to check if configured.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, handling identity changes and invalidating dependent queries when actor updates.",
  "frontend/src/hooks/useAddComment.ts": "Mutation hook for adding comments to videos, invalidating video comments and video queries on success.",
  "frontend/src/hooks/useAddProduct.ts": "Mutation hook for adding products to the store, invalidating products query on success.",
  "frontend/src/hooks/useAddToCart.ts": "Mutation hook for adding items to the shopping cart, invalidating cart query on success.",
  "frontend/src/hooks/useDeleteComment.ts": "Mutation hook for deleting comments, invalidating video comments and video queries on success.",
  "frontend/src/hooks/useDeleteFoodEntry.ts": "Mutation hook for deleting food entries, invalidating user food entries query on success.",
  "frontend/src/hooks/useDeleteProduct.ts": "Mutation hook for deleting products from the store, invalidating products query on success.",
  "frontend/src/hooks/useDeleteRunningSession.ts": "Mutation hook for deleting running sessions, invalidating running sessions query on success.",
  "frontend/src/hooks/useEditFoodEntry.ts": "Mutation hook for editing food entries, invalidating user food entries and specific food entry queries on success.",
  "frontend/src/hooks/useEditProduct.ts": "Mutation hook for editing product details, invalidating products query on success.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile, enabled only when actor is available.",
  "frontend/src/hooks/useGetCart.ts": "Query hook that fetches the user's shopping cart items, enabled only when authenticated with identity.",
  "frontend/src/hooks/useGetExternalProducts.ts": "Query hook that fetches and transforms external products from Go Store API if configured, returning empty array if not configured or on error.",
  "frontend/src/hooks/useGetFoodEntry.ts": "Query hook that fetches a specific food entry by ID, enabled only when actor and entryId are available.",
  "frontend/src/hooks/useGetOrder.ts": "Query hook that fetches a specific order by ID, enabled only when actor is available.",
  "frontend/src/hooks/useGetProduct.ts": "Query hook that fetches a specific product by ID, enabled only when actor is available.",
  "frontend/src/hooks/useGetUserFoodEntries.ts": "Query hook that fetches all food entries for the authenticated user, enabled only when authenticated with identity.",
  "frontend/src/hooks/useGetUserOrders.ts": "Query hook that fetches all orders for the authenticated user, enabled only when authenticated with identity.",
  "frontend/src/hooks/useGetUserProfile.ts": "Query hook that fetches a user profile by Principal ID, enabled only when actor and userId are available.",
  "frontend/src/hooks/useGetUserRunningSessions.ts": "Query hook that fetches all running sessions for the authenticated user, enabled only when authenticated with identity.",
  "frontend/src/hooks/useGetVideo.ts": "Query hook that fetches a specific video by ID, enabled only when actor and videoId are available.",
  "frontend/src/hooks/useGetVideoComments.ts": "React Query hook that fetches comments for a specific video by ID using the actor backend.",
  "frontend/src/hooks/useGetVideos.ts": "React Query hook that fetches all videos from the backend actor.",
  "frontend/src/hooks/useGetWorkouts.ts": "React Query hook that fetches workouts for the authenticated user from the backend actor.",
  "frontend/src/hooks/useHasLikedVideo.ts": "React Query hook that checks if the authenticated user has liked a specific video.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider with login, logout, and identity state management using AuthClient.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the authenticated caller has admin privileges.",
  "frontend/src/hooks/useLikeVideo.ts": "React Query mutation hook that likes a video and invalidates related queries on success.",
  "frontend/src/hooks/useLogFood.ts": "React Query mutation hook that adds a food entry and invalidates the user food entries query.",
  "frontend/src/hooks/useLogRunningSession.ts": "React Query mutation hook that logs a running session with distance, duration, and notes.",
  "frontend/src/hooks/useLogWorkout.ts": "React Query mutation hook that logs a workout and invalidates the workouts query.",
  "frontend/src/hooks/usePlaceOrder.ts": "React Query mutation hook that places an order with a shipping address and invalidates cart and orders queries.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating query hooks are organized in separate files.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the caller's user profile and invalidates the current user profile query.",
  "frontend/src/hooks/useSearchProducts.ts": "React Query hook that searches for products by search term using the backend actor.",
  "frontend/src/hooks/useUnlikeVideo.ts": "React Query mutation hook that unlikes a video and invalidates related queries on success.",
  "frontend/src/hooks/useUploadVideo.ts": "React Query mutation hook that uploads a video with title, description, and file blob.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom fitness-themed color variables for light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AddFood.tsx": "Page component for searching and logging food entries with nutritional information, requiring user authentication.",
  "frontend/src/pages/AddRunningSession.tsx": "Form page for logging a new running session with distance, duration, and optional notes fields. Uses react-hook-form for validation and navigates back to running monitor on success.",
  "frontend/src/pages/AddWorkout.tsx": "Form page for logging a new workout entry using the WorkoutForm component. Handles submission via useLogWorkout hook and navigates to workout tracker on success.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard landing page that checks admin permissions and displays a card with a link to product management. Shows access denied screen if user is not an admin.",
  "frontend/src/pages/AdminProductManagement.tsx": "Admin page for managing internal products with a table view, add/edit/delete functionality via dialogs, and admin permission checks. Filters products to show only internal inventory items.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with quantity controls and a summary sidebar. Requires authentication and shows empty state with link to store when cart is empty.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with shipping form and cart summary sidebar. Places order on form submission and redirects to order confirmation page.",
  "frontend/src/pages/FiTube.tsx": "Video sharing platform page with hero banner and grid of video cards. Requires authentication and includes upload button to add new videos.",
  "frontend/src/pages/FoodTracker.tsx": "Nutrition tracking page displaying daily macro summary and list of food entries. Requires authentication and includes button to log new food items.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays order confirmation page after successful checkout, showing order details, shipping address, total, and navigation buttons to order history or store.",
  "frontend/src/pages/OrderDetail.tsx": "Shows detailed view of a single order including items with product images, quantities, shipping address, and total cost with back navigation to order history.",
  "frontend/src/pages/OrderHistory.tsx": "Lists all orders for the logged-in user, displaying empty state if no orders exist or requiring login if user is not authenticated.",
  "frontend/src/pages/ProductDetail.tsx": "Displays detailed product information including image, description, price, availability, and add-to-cart functionality with authentication check.",
  "frontend/src/pages/RunningMonitor.tsx": "Shows running statistics dashboard with total runs, distance, and duration, plus list of running sessions for authenticated users.",
  "frontend/src/pages/Store.tsx": "Main store page with hero banner, search functionality, category filters, and product grid merging internal and external products with add-to-cart capability.",
  "frontend/src/pages/UploadVideo.tsx": "Video upload page with form for title, description, and video file (max 100MB), using ExternalBlob for chunked upload with progress tracking and navigation to video detail on success.",
  "frontend/src/pages/VideoDetail.tsx": "Video detail page displaying video player, metadata, uploader info, like/unlike functionality, share button, and comments section with authentication checks.",
  "frontend/src/pages/WorkoutTracker.tsx": "Workout tracker page with hero section, list of logged workouts displayed as cards, and button to add new workouts with authentication guard.",
  "frontend/src/types/ExternalProduct.ts": "TypeScript interface defining external product structure with id, name, price, imageUrl, externalUrl, and isExternal flag.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (energetic-orange, vibrant-green, bold-red, sunny-yellow), extended theme settings, container queries, typography, and animation plugins.",
  "project_state.json": "Project state tracking for FIT AMIGO platform documenting existing features (FiTube, Running Monitor, Workout Tracker) and in-progress Food Tracker feature with Nutritionix API integration."
}