{
  "kind": "build_request",
  "title": "Add mock data and search functionality to Store and FiTube sections",
  "projectName": "FIT AMIGO",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-67",
      "text": "Remove external API dependencies from Store page (frontend/src/pages/Store.tsx) and replace useGetExternalSportsProducts hook with local mock data containing realistic sports products across categories: gym equipment (dumbbells, barbells, resistance bands, kettlebells), running gear (running shoes, GPS watches, hydration packs), sports apparel (workout shirts, shorts, leggings, jackets), and supplements (protein powder, pre-workout, BCAAs, vitamins). Each mock product should include: id, name, description, price, imageUrl (placeholder or stock image URL), category, and externalProductUrl fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Replace external API dependency with mock/placeholder sports product data"
        ]
      },
      "acceptanceCriteria": [
        "Store page loads successfully without requiring external API configuration",
        "Mock product data includes at least 12-16 products across all four categories",
        "Products display with images, names, descriptions, and prices",
        "External product URLs open in new tabs when clicked"
      ]
    },
    {
      "id": "REQ-68",
      "text": "Add a search input field at the top of the Store page (frontend/src/pages/Store.tsx) that allows users to filter displayed products by name or description in real-time. Implement client-side search filtering that updates the visible products as the user types, with debouncing (300ms delay) to improve performance. The search should work seamlessly with existing category and price filters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Add a search bar/input field on the Store page that allows users to search/filter the displayed products"
        ]
      },
      "acceptanceCriteria": [
        "Search input field is prominently displayed at the top of the Store page",
        "Search filters products by name and description with case-insensitive matching",
        "Search results update with 300ms debounce as user types",
        "Search works in combination with category and price filters",
        "Empty state message displays when no products match search criteria"
      ]
    },
    {
      "id": "REQ-69",
      "text": "Remove external API dependencies from FiTube page (frontend/src/pages/FiTube.tsx) and replace useGetExternalFitnessVideos hook with local mock data containing realistic fitness videos across categories: workout tutorials (strength training, HIIT, yoga, pilates), running tips (form analysis, training plans, injury prevention), nutrition advice (meal prep, supplement guides), and sports performance (technique breakdowns, drills). Each mock video should include: id, title, description, thumbnailUrl (placeholder or stock thumbnail), videoUrl or embedUrl, uploader/channel name, view count, and duration fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Replace external video API dependency with mock/placeholder fitness video data"
        ]
      },
      "acceptanceCriteria": [
        "FiTube page loads successfully without requiring external API configuration",
        "Mock video data includes at least 12-16 videos across different fitness categories",
        "Videos display in grid layout with thumbnails, titles, uploader names, and view counts",
        "Video cards are clickable and navigate to video detail page or open external video URLs",
        "Existing video upload functionality remains intact for internal videos"
      ]
    },
    {
      "id": "REQ-70",
      "text": "Update useGetExternalSportsProducts hook (frontend/src/hooks/useGetExternalSportsProducts.ts) to return mock data instead of making API calls. The hook should maintain the same TypeScript interface and return type but serve local mock data immediately without network requests. Include a comment explaining that this is mock data for demonstration purposes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "modify the Store and FiTube pages to work independently without requiring external API setup"
        ]
      },
      "acceptanceCriteria": [
        "Hook returns mock data synchronously without API calls",
        "TypeScript types remain unchanged",
        "Hook includes documentation comment about mock data usage",
        "No external API configuration required"
      ]
    },
    {
      "id": "REQ-71",
      "text": "Update useGetExternalFitnessVideos hook (frontend/src/hooks/useGetExternalFitnessVideos.ts) to return mock data instead of making API calls. The hook should maintain the same TypeScript interface and return type but serve local mock data immediately without network requests. Include a comment explaining that this is mock data for demonstration purposes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "modify the Store and FiTube pages to work independently without requiring external API setup"
        ]
      },
      "acceptanceCriteria": [
        "Hook returns mock data synchronously without API calls",
        "TypeScript types remain unchanged",
        "Hook includes documentation comment about mock data usage",
        "No external API configuration required"
      ]
    }
  ],
  "constraints": [
    "Maintain existing TypeScript interfaces for ExternalSportsProduct and ExternalFitnessVideo types",
    "Do not modify read-only paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*",
    "Keep existing video upload functionality and internal product management features intact",
    "Preserve existing category filtering and price filtering UI components on Store page"
  ],
  "nonGoals": [
    "Implementing actual external API integration",
    "Adding video playback functionality beyond existing implementation",
    "Modifying backend data structures or API methods",
    "Changing authentication or authorization logic",
    "Adding shopping cart functionality for mock products"
  ],
  "imageRequirements": {
    "required": [
      "Placeholder product image for gym equipment showing dumbbells and weights (product-gym-equipment.dim_400x400.png)",
      "Placeholder product image for running shoes with athletic styling (product-running-shoes.dim_400x400.png)",
      "Placeholder product image for sports apparel showing workout clothing (product-apparel.dim_400x400.png)",
      "Placeholder product image for protein supplements and powder containers (product-supplements.dim_400x400.png)",
      "Placeholder video thumbnail for strength training workout (video-strength-training.dim_640x360.png)",
      "Placeholder video thumbnail for running form tutorial (video-running-form.dim_640x360.png)",
      "Placeholder video thumbnail for yoga session (video-yoga.dim_640x360.png)",
      "Placeholder video thumbnail for nutrition meal prep guide (video-nutrition.dim_640x360.png)"
    ],
    "edits": []
  }
}