{
  "kind": "build_request",
  "title": "Integrate external APIs for sports products in Store and fitness videos in FiTube",
  "projectName": "FIT AMIGO",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Create backend method in main.mo to fetch external sports products (gym equipment, running gear, sports apparel, supplements) from a configurable external API endpoint. The method should accept optional category and search filters, call the external API with proper error handling, parse the JSON response, and return an array of products with fields: id, name, description, price, imageUrl, category, and externalProductUrl. Follow the same pattern as the existing fetchExternalProducts method for Go Store API.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Store needs to show product photo and price and Link to external API. gym equipment, running gear, sports apparel, supplements.",
          "integrate with external APIs to automatically populate sports products"
        ]
      },
      "acceptanceCriteria": [
        "Backend method accepts optional category filter (gym equipment, running gear, sports apparel, supplements)",
        "Method calls external sports products API with proper error handling for network failures",
        "Returns array of products with id, name, description, price, imageUrl, category, and externalProductUrl fields",
        "API endpoint URL and credentials are configurable via initialization parameters (similar to Go Store API pattern)"
      ]
    },
    {
      "id": "REQ-58",
      "text": "Create React Query hook useGetExternalSportsProducts in frontend/src/hooks/useGetExternalSportsProducts.ts that calls the backend method to fetch external sports products. Include optional category filter parameter, proper TypeScript typing for product results, error handling, and enable the query only when the actor is available. Follow the same pattern as useGetExternalProducts hook.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Store needs to show product photo and price and Link to external API",
          "integrate with external APIs to automatically populate sports products"
        ]
      },
      "acceptanceCriteria": [
        "Hook accepts optional category filter parameter",
        "Returns properly typed external sports products array",
        "Includes loading, error, and success states",
        "Query is enabled only when actor is available",
        "Follows existing useGetExternalProducts pattern"
      ]
    },
    {
      "id": "REQ-59",
      "text": "Update the Store page (frontend/src/pages/Store.tsx) to display external sports products fetched from the new external API instead of or alongside the existing Go Store products. Each product card should show the product photo, name, price, and a button/link that opens the external product URL in a new tab. Remove or hide internal product management features (add to cart) for external products. Include category filtering for gym equipment, running gear, sports apparel, and supplements.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Store needs to show product photo and price and Link to external API. gym equipment, running gear, sports apparel, supplements."
        ]
      },
      "acceptanceCriteria": [
        "Store page displays external sports products with photos, names, and prices",
        "Each external product has a clickable link/button that opens the external product URL in a new tab",
        "Category filter includes options for gym equipment, running gear, sports apparel, and supplements",
        "External products are clearly distinguished from any internal products (if still shown)",
        "Product cards use the existing ProductCard component pattern with isExternal flag"
      ]
    },
    {
      "id": "REQ-60",
      "text": "Create backend method in main.mo to fetch sports and fitness videos from a configurable external video API endpoint. The method should call the external API with proper error handling, parse the JSON response, and return an array of videos with fields: id, title, description, thumbnailUrl, videoUrl (or embedUrl), uploader/channel name, view count, and duration. Follow similar patterns to existing external API integrations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "FiTube page to automatically fetch/display sports videos from an external source",
          "integrate with external APIs to automatically populate fitness videos"
        ]
      },
      "acceptanceCriteria": [
        "Backend method calls external fitness video API with error handling",
        "Returns array of videos with id, title, description, thumbnailUrl, videoUrl/embedUrl, uploader name, view count, and duration",
        "API endpoint URL and credentials are configurable via initialization parameters",
        "Handles API failures gracefully and returns empty array or error indicator"
      ]
    },
    {
      "id": "REQ-61",
      "text": "Create React Query hook useGetExternalFitnessVideos in frontend/src/hooks/useGetExternalFitnessVideos.ts that calls the backend method to fetch external sports and fitness videos. Include proper TypeScript typing for video results, error handling, and enable the query only when the actor is available. Follow the pattern of existing video hooks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "FiTube page to automatically fetch/display sports videos from an external source"
        ]
      },
      "acceptanceCriteria": [
        "Hook fetches external fitness videos via backend method",
        "Returns properly typed video array with id, title, description, thumbnailUrl, videoUrl, uploader, viewCount, duration",
        "Includes loading, error, and success states",
        "Query is enabled only when actor is available"
      ]
    },
    {
      "id": "REQ-62",
      "text": "Update the FiTube page (frontend/src/pages/FiTube.tsx) to display external sports and fitness videos fetched from the external API on the main video browsing page at /fitube. Display videos in a grid layout showing video thumbnails, titles, uploader names, and view counts. Each video card should be clickable and navigate to a detail view or open the external video URL. Maintain the existing video upload functionality for internal videos if needed, or clearly distinguish between internal and external videos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "FiTube page to automatically fetch/display sports videos from an external source",
          "Videos will appear on the main FiTube browsing page at /fitube"
        ]
      },
      "acceptanceCriteria": [
        "FiTube main page displays external fitness videos in grid layout",
        "Each video shows thumbnail, title, uploader name, and view count",
        "Videos are clickable and navigate to detail view or open external URL",
        "External videos are visually distinguished from internal uploaded videos (if both are shown)",
        "Loading and error states are handled appropriately"
      ]
    },
    {
      "id": "REQ-63",
      "text": "Add configuration instructions to frontend/README.md for the external sports products API, including environment variable placeholders for VITE_SPORTS_PRODUCTS_API_URL and VITE_SPORTS_PRODUCTS_API_KEY. Document that these credentials need to be configured post-deployment, following the same pattern as the existing Go Store API and Fitness Search API configuration instructions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "integrate with external APIs to automatically populate sports products",
          "Both integrations will use environment variables for API credentials that you'll configure post-deployment"
        ]
      },
      "acceptanceCriteria": [
        "README.md includes section for sports products API configuration",
        "Documents VITE_SPORTS_PRODUCTS_API_URL environment variable",
        "Documents VITE_SPORTS_PRODUCTS_API_KEY environment variable",
        "Follows same documentation pattern as Go Store API and Fitness Search API sections",
        "Includes instructions for post-deployment configuration"
      ]
    },
    {
      "id": "REQ-64",
      "text": "Add sports products API configuration to frontend/.env.example with placeholder values for VITE_SPORTS_PRODUCTS_API_URL and VITE_SPORTS_PRODUCTS_API_KEY, following the same pattern as the existing Go Store API and Fitness Search API environment variables.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Both integrations will use environment variables for API credentials that you'll configure post-deployment"
        ]
      },
      "acceptanceCriteria": [
        ".env.example includes VITE_SPORTS_PRODUCTS_API_URL with placeholder value",
        ".env.example includes VITE_SPORTS_PRODUCTS_API_KEY with placeholder value",
        "Follows existing environment variable naming and format conventions"
      ]
    },
    {
      "id": "REQ-65",
      "text": "Add configuration instructions to frontend/README.md for the external fitness videos API, including environment variable placeholders for VITE_FITNESS_VIDEOS_API_URL and VITE_FITNESS_VIDEOS_API_KEY. Document that these credentials need to be configured post-deployment, following the same pattern as other external API configurations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "FiTube page to automatically fetch/display sports videos from an external source",
          "Both integrations will use environment variables for API credentials that you'll configure post-deployment"
        ]
      },
      "acceptanceCriteria": [
        "README.md includes section for fitness videos API configuration",
        "Documents VITE_FITNESS_VIDEOS_API_URL environment variable",
        "Documents VITE_FITNESS_VIDEOS_API_KEY environment variable",
        "Follows same documentation pattern as other API configuration sections",
        "Includes instructions for post-deployment configuration"
      ]
    },
    {
      "id": "REQ-66",
      "text": "Add fitness videos API configuration to frontend/.env.example with placeholder values for VITE_FITNESS_VIDEOS_API_URL and VITE_FITNESS_VIDEOS_API_KEY, following the same pattern as existing external API environment variables.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Both integrations will use environment variables for API credentials that you'll configure post-deployment"
        ]
      },
      "acceptanceCriteria": [
        ".env.example includes VITE_FITNESS_VIDEOS_API_URL with placeholder value",
        ".env.example includes VITE_FITNESS_VIDEOS_API_KEY with placeholder value",
        "Follows existing environment variable naming and format conventions"
      ]
    }
  ],
  "constraints": [
    "Use existing fetchExternalProducts pattern for implementing the sports products API integration",
    "Maintain single-actor backend architecture with all logic in main.mo",
    "Do not modify immutable frontend paths: useInternetIdentity.ts, useInternetIdentity.tsx, useActor.ts, main.tsx, components/ui/*",
    "Follow existing external API integration patterns (Go Store API, Fitness Search API)",
    "API credentials must be configurable via environment variables post-deployment"
  ],
  "nonGoals": [
    "Removing or replacing existing internal product management features in admin dashboard",
    "Implementing real-time video streaming or live content",
    "Creating custom video player components (use existing video player patterns)",
    "Integrating with specific third-party services like YouTube API or Amazon Product API (generic API pattern)",
    "Building native mobile applications"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}