{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add mock data and search functionality to Store and FiTube sections",
  "requirements": [
    {
      "id": "REQ-67",
      "summary": "Replace external API dependency in Store page with local mock sports product data",
      "acceptanceCriteria": [
        "Store page loads successfully without requiring external API configuration",
        "Mock product data includes at least 12-16 products across all four categories",
        "Products display with images, names, descriptions, and prices",
        "External product URLs open in new tabs when clicked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Store.tsx",
          "operation": "modify",
          "description": "Update Store page to use mock data from useGetExternalSportsProducts hook instead of relying on external API configuration. Ensure products from all sources (internal, mock external, mock sports) are displayed and filtered correctly. Reference generated product images using workspace paths: frontend/public/assets/generated/product-gym-equipment.dim_400x400.png, frontend/public/assets/generated/product-running-shoes.dim_400x400.png, frontend/public/assets/generated/product-apparel.dim_400x400.png, and frontend/public/assets/generated/product-supplements.dim_400x400.png in the mock data structure."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Add search input field with debouncing to Store page for filtering products",
      "acceptanceCriteria": [
        "Search input field is prominently displayed at the top of the Store page",
        "Search filters products by name and description with case-insensitive matching",
        "Search results update with 300ms debounce as user types",
        "Search works in combination with category and price filters",
        "Empty state message displays when no products match search criteria"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Store.tsx",
          "operation": "modify",
          "description": "Add a search input field at the top of the Store page that filters displayed products by name or description in real-time. Implement client-side filtering with 300ms debouncing using React state and useEffect. Ensure search works seamlessly with existing category and price filters. Display empty state message when no products match search criteria."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Replace external API dependency in FiTube page with local mock fitness video data",
      "acceptanceCriteria": [
        "FiTube page loads successfully without requiring external API configuration",
        "Mock video data includes at least 12-16 videos across different fitness categories",
        "Videos display in grid layout with thumbnails, titles, uploader names, and view counts",
        "Video cards are clickable and navigate to video detail page or open external video URLs",
        "Existing video upload functionality remains intact for internal videos"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FiTube.tsx",
          "operation": "modify",
          "description": "Update FiTube page to display mock external fitness videos alongside internal videos. Ensure both internal and external videos are displayed in the grid layout. Reference generated video thumbnail images using workspace paths: frontend/public/assets/generated/video-strength-training.dim_640x360.png, frontend/public/assets/generated/video-running-form.dim_640x360.png, frontend/public/assets/generated/video-yoga.dim_640x360.png, and frontend/public/assets/generated/video-nutrition.dim_640x360.png in the mock data structure. Preserve existing video upload functionality for authenticated users."
        }
      ]
    },
    {
      "id": "REQ-70",
      "summary": "Update useGetExternalSportsProducts hook to return mock data instead of making API calls",
      "acceptanceCriteria": [
        "Hook returns mock data synchronously without API calls",
        "TypeScript types remain unchanged",
        "Hook includes documentation comment about mock data usage",
        "No external API configuration required"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGetExternalSportsProducts.ts",
          "operation": "modify",
          "description": "Replace external API calls with local mock data containing realistic sports products across categories: gym equipment, running gear, sports apparel, and supplements. Each mock product should include id, name, description, price, imageUrl (using generated image paths like /assets/generated/product-gym-equipment.dim_400x400.png), category, and externalProductUrl fields. Maintain the same TypeScript interface and return type. Add a comment explaining this is mock data for demonstration purposes. Remove dependency on API configuration checks."
        }
      ]
    },
    {
      "id": "REQ-71",
      "summary": "Update useGetExternalFitnessVideos hook to return mock data instead of making API calls",
      "acceptanceCriteria": [
        "Hook returns mock data synchronously without API calls",
        "TypeScript types remain unchanged",
        "Hook includes documentation comment about mock data usage",
        "No external API configuration required"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGetExternalFitnessVideos.ts",
          "operation": "modify",
          "description": "Replace external API calls with local mock data containing realistic fitness videos across categories: workout tutorials (strength training, HIIT, yoga, pilates), running tips, nutrition advice, and sports performance. Each mock video should include id, title, description, thumbnailUrl (using generated thumbnail paths like /assets/generated/video-strength-training.dim_640x360.png), videoUrl or embedUrl, uploader/channel name, view count, and duration fields. Maintain the same TypeScript interface and return type. Add a comment explaining this is mock data for demonstration purposes. Remove dependency on API configuration checks."
        }
      ]
    }
  ]
}